espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/src/em_cmu.c
  if (CMU_ClockSelectGet(cmuClock_SYSCLK) == cmuSelect_HFRCODPLL) {
    // Set max wait-states and PCLK divisor while changing core clock
    waitStateMax();
    pclkDivMax();
#if ((defined(CMU_SYSCLKCTRL_RHCLKPRESC)) \
    && (_SILICON_LABS_EFR32_RADIO_TYPE != _SILICON_LABS_EFR32_RADIO_NONE))
    // Set largest prescaler for radio clock tree
    rhclkPrescMax();
#endif

    // Increase HCLK divider value (if possible) while locking DPLL to
    // avoid over-clocking.
    hclkDiv = CMU_ClockDivGet(cmuClock_HCLK);
    hclkDivIncreased = true;
    if (hclkDiv == 1U) {
      CMU_ClockDivSet(cmuClock_HCLK, 2U);
    } else if (hclkDiv == 2U) {
      CMU_ClockDivSet(cmuClock_HCLK, 4U);
    } else {
      hclkDivIncreased = false;
    }
  }

  // updates to the CAL register are deferred if FREQBSY is high, so wait
  // until HFRCO is not busy to keep going
  while (HFRCO0->STATUS & (HFRCO_STATUS_SYNCBUSY | HFRCO_STATUS_FREQBSY)) {
  }

  /*
   * Some devices have clamped frequency ranges, so instead of the usual [0:16]
   * interval, the upper limit is 12. Hardware takes care of clamping the value,
   * but a situation might occur where tuning and frequency range are not
   * in sync. So try to detect if the value has been clamped, and if it happened
   * revert back to the previous value.
   */
  hfrcoCalCurrent = HFRCO0->CAL;
  HFRCO0->CAL = hfrcoCalVal;

  // values are not shifted, not necessary for comparison
  hfrcoFreqRangeExpected = (hfrcoCalVal & _HFRCO_CAL_FREQRANGE_MASK);
  hfrcoFreqRangeActual   = (HFRCO0->CAL & _HFRCO_CAL_FREQRANGE_MASK);

  EFM_ASSERT(hfrcoFreqRangeExpected == hfrcoFreqRangeActual);
  if (hfrcoFreqRangeExpected == hfrcoFreqRangeActual) {
    DPLL0->CFG1   = ((uint32_t)init->n   << _DPLL_CFG1_N_SHIFT)
                    | ((uint32_t)init->m << _DPLL_CFG1_M_SHIFT);
    CMU_ClockSelectSet(cmuClock_DPLLREFCLK, init->refClk);
    DPLL0->CFG = ((init->autoRecover ? 1UL : 0UL) << _DPLL_CFG_AUTORECOVER_SHIFT)
                 | ((init->ditherEn ? 1UL : 0UL)  << _DPLL_CFG_DITHEN_SHIFT)
                 | ((uint32_t)init->edgeSel  << _DPLL_CFG_EDGESEL_SHIFT)
                 | ((uint32_t)init->lockMode << _DPLL_CFG_MODE_SHIFT);

    // Update CMSIS HFRCODPLL frequency.
    SystemHFRCODPLLClockSet(init->frequency);
  } else {
    hfrcoClamped = true;
    HFRCO0->CAL = hfrcoCalCurrent;
  }

  /*
   * if HFRCO frequency range has been clamped, re-enable DPLL only if it was
   * previously enabled
   */
  if (!hfrcoClamped || restoreDpll) {
    DPLL0->IF_CLR = DPLL_IF_LOCK | DPLL_IF_LOCKFAILLOW | DPLL_IF_LOCKFAILHIGH;

    // Lock DPLL
    DPLL0->EN_SET = DPLL_EN_EN;
    while ((lockStatus = (DPLL0->IF & (DPLL_IF_LOCK
                                       | DPLL_IF_LOCKFAILLOW
                                       | DPLL_IF_LOCKFAILHIGH))) == 0UL) {
    }
  }

  if (CMU_ClockSelectGet(cmuClock_SYSCLK) == cmuSelect_HFRCODPLL) {
    if (hclkDivIncreased) {
      // Restore original HCLK divider
      CMU_ClockDivSet(cmuClock_HCLK, hclkDiv);
    }

    // Call @ref SystemCoreClockGet() to update CMSIS core clock variable.
    sysFreq = SystemCoreClockGet();
    EFM_ASSERT(sysFreq <= init->frequency);
    EFM_ASSERT(sysFreq <= SystemHFRCODPLLClockGet());
    EFM_ASSERT(init->frequency == SystemHFRCODPLLClockGet());

    // Set optimal wait-states and PCLK divisor
    CMU_UpdateWaitStates(sysFreq, VSCALE_DEFAULT);
    pclkDivOptimize();
#if (defined(CMU_SYSCLKCTRL_RHCLKPRESC) \
    && (_SILICON_LABS_EFR32_RADIO_TYPE != _SILICON_LABS_EFR32_RADIO_NONE))
    // Set optimal RHCLK prescaler
    rhclkPrescOptimize();
#endif
  }

  if (hfrcoClamped) {
    return false;
  } else if (lockStatus == DPLL_IF_LOCK) {
    return true;
  }
  return false;
}

#if defined(USBPLL_PRESENT)
/***************************************************************************//**
 * @brief
 *   Initialize the PLL control registers.
 *
 * @note
 *  The HFXO reference frequency must be updated if crystal value is
 *  different from default value.
 *
 * @param[in] pllInit
 *   USB PLL parameters
 ******************************************************************************/
void CMU_USBPLLInit(const CMU_PLL_Init_TypeDef *pllInit)
{
  CMU->CLKEN1_SET = CMU_CLKEN1_USB;

  USBPLL0->LOCK = PLL_LOCK_LOCKKEY_UNLOCK;

  // Stop the PLL for configuration purposes
  USBPLL0->CTRL_SET = PLL_CTRL_DISONDEMAND;
  USBPLL0->CTRL_CLR = PLL_CTRL_FORCEEN;

  while (USBPLL0->STATUS & PLL_STATUS_PLLLOCK) ;

  if (pllInit->hfxoRefFreq == cmuHFXORefFreq_39M0Hz) {
    // Set DCO in low frequency mode for 39 MHz crystal.
    USBPLL0->DCOCTRL_SET = _PLL_DCOCTRL_DCOBIASHALF_MASK;
  } else {
    USBPLL0->DCOCTRL_CLR = _PLL_DCOCTRL_DCOBIASHALF_MASK;
  }

  while (USBPLL0->STATUS & PLL_STATUS_SYNCBUSY) ;

  USBPLL0->CTRL = (USBPLL0->CTRL & ~(_PLL_CTRL_SHUNTREGLPEN_MASK
                                     | _PLL_CTRL_DIVR_MASK
                                     | _PLL_CTRL_DIVX_MASK
                                     | _PLL_CTRL_DIVN_MASK
                                     | _PLL_CTRL_DISONDEMAND_MASK
                                     | _PLL_CTRL_FORCEEN_MASK))
                  | pllInit->hfxoRefFreq
                  | pllInit->shuntRegEn  << _PLL_CTRL_SHUNTREGLPEN_SHIFT
                  | pllInit->disOnDemand << _PLL_CTRL_DISONDEMAND_SHIFT
                  | pllInit->forceEn     << _PLL_CTRL_FORCEEN_SHIFT;

  while (USBPLL0->STATUS & PLL_STATUS_SYNCBUSY) ;

  if (pllInit->forceEn) {
    CMU_WaitUSBPLLLock();
  }

  if (pllInit->regLock) {
    USBPLL0->LOCK = ~PLL_LOCK_LOCKKEY_UNLOCK;
  }
}
#endif

#if defined(RFFPLL_PRESENT)
/***************************************************************************//**
 * @brief
 *   Initialize the RFFPLL control registers.
 *
 * @param[in] pllInit
 *   RFF PLL parameters
 ******************************************************************************/
void CMU_RFFPLLInit(const CMU_RFFPLL_Init_TypeDef *pllInit)
{
  EFM_ASSERT(CMU_ClockSelectGet(cmuClock_SYSCLK) != cmuSelect_RFFPLLSYS);
  EFM_ASSERT(pllInit->dividerY >= 8 && pllInit->dividerY <= 31);
  EFM_ASSERT(pllInit->dividerX >= 4 && pllInit->dividerX <= 15);
  EFM_ASSERT(pllInit->dividerN >= 32 && pllInit->dividerN <= 127);

